Repository: student-hub/acs-upb-mobile
Catalog: lib/l10n/intl_*.arb
Languages: ro

# buttonNext
source: Next
ro: Următorul

# buttonCancel
source: Cancel
ro: Anulare

# buttonSave
source: Save
ro: Salvare

# buttonSend
source: Send
ro: Trimitere

# buttonApply
source: Apply
ro: Aplică

# buttonSet
source: Set
ro: Setează

# buttonDeny
source: Deny
ro: Refuză

# buttonAccept
source: Accept
ro: Acceptă

# buttonRevert
source: Revert
ro: Anulează

# labelPassword
source: Password
ro: Parolă

# labelOldPassword
source: Old password
ro: Parolă veche

# labelNewPassword
source: New password
ro: Parolă nouă

# labelConfirmPassword
source: Confirm password
ro: Confirmare parolă

# labelConfirmNewPassword
source: Confirm new password
ro: Confirmare parolă nouă

# labelAskPermissions
source: Request editing permissions
ro: Cere permisiuni de editare

# labelAnswer
source: Answer
ro: Răspuns

# labelVersion
source: Version
ro: Versiunea

# labelFirstName
source: First name
ro: Prenume

# labelLastName
source: Last name
ro: Nume

# labelProfilePicture
source: Profile picture
ro: Imagine profil

# labelWebsiteIcon
source: Website icon
ro: Imagine website

# labelName
source: Name
ro: Nume

# labelCategory
source: Category
ro: Categorie

# labelRelevance
source: Relevance
ro: Relevanță

# labelPreview
source: Preview
ro: Previzualizare

# labelDescription
source: Description
ro: Descriere

# labelCustom
source: Custom
ro: Alta

# labelType
source: Type
ro: Tip

# labelLocation
source: Location
ro: Locație

# labelColor
source: Color
ro: Culoare

# labelStart
source: Start
ro: Început

# labelEnd
source: End
ro: Sfârșit

# labelClass
source: Class
ro: Materie

# labelLecturer
source: Lecturer
ro: Profesor

# labelAssistant
source: Assistant
ro: Asistent

# labelYear
source: Year
ro: Anul

# labelSemester
source: Semester
ro: Semestrul

# labelTeam
source: {name} team
ro: Echipa {name}

# labelUnknown
source: Unknown
ro: Necunoscut

# labelEvaluation
source: Evaluation
ro: Evaluare

# labelPoints
source: Points
ro: Puncte

# labelGrade
source: Grade
ro: Notă

# labelPrivacyPolicy
source: Privacy Policy
ro: Politică de confidențialitate

# labelPersonalInformation
source: Personal information
ro: Informații personale

# labelPermissionsConsent
source: consent for editing rights
ro: consimțământul pentru drepturi de editare

# labelFeedbackPolicy
source: feedback policy
ro: politica de feedback

# labelLastUpdated
source: Last updated
ro: Ultima modificare

# labelUniversityYear
source: University year
ro: An universitar

# labelWeek
source: Week
ro: Săptămână

# labelEven
source: Even
ro: Pară

# labelOdd
source: Odd
ro: Impară

# labelDay
source: Day
ro: Zi

# labelToday
source: Today
ro: Astăzi

# labelTomorrow
source: Tomorrow
ro: Mâine

# labelNow
source: Now
ro: Acum

# labelPeople
source: People
ro: Persoane

# labelClasses
source: Classes
ro: Materii

# sectionShortcuts
source: Shortcuts
ro: Scurtături

# sectionEvents
source: Events
ro: Evenimente

# sectionFrequentlyAccessedWebsites
source: Favourite websites
ro: Website-uri favorite

# sectionEventsComingUp
source: Events coming up
ro: Evenimente următoare

# sectionFAQ
source: FAQ
ro: Întrebări frecvente

# sectionGrading
source: Grading
ro: Punctaj

# sectionFeedbackNeeded
source: Feedback needed
ro: Feedback necesar

# sectionFeedbackCompleted
source: Feedback completed
ro: Feedback completat

# shortcutTypeMain
source: Main page
ro: Pagina principală

# shortcutTypeClassbook
source: Classbook
ro: Catalog

# shortcutTypeResource
source: Resource
ro: Resursă

# shortcutTypeOther
source: Other
ro: Alta

# hintEvaluation
source: Final exam
ro: Examen final

# actionSignUp
source: Sign up
ro: Înregistrare

# actionLogIn
source: Log in
ro: Conectare

# actionLogOut
source: Log out
ro: Deconectare

# actionLogInAnonymously
source: Log in anonymously
ro: Conectare anonimă

# actionEditProfile
source: Edit profile
ro: Modifică profil

# actionSocialLogin
source: Social login
ro: Rețele sociale

# actionSignInWith
source: Sign in with {provider}
ro: Conectare cu {provider}

# actionResetPassword
source: Reset password
ro: Resetare parolă

# actionSendEmail
source: Send e-mail
ro: Trimite e-mail

# actionChangeEmail
source: Change email
ro: Schimbă email

# actionSendVerificationAgain
source: Send e-mail again?
ro: Trimite mail din nou?

# actionDeleteAccount
source: Delete account
ro: Ștergere cont

# actionChangePassword
source: Change password
ro: Schimbă parola

# actionAddWebsite
source: Add website
ro: Adaugă website

# actionEditWebsite
source: Edit website
ro: Modifică website

# actionDeleteWebsite
source: Delete website
ro: Șterge website

# actionEnableEditing
source: Enable editing
ro: Activează modul editare

# actionDisableEditing
source: Disable editing
ro: Dezactivează modul editare

# actionJumpToToday
source: Jump to today
ro: Sari la ziua de azi

# actionAddEvent
source: Add event
ro: Adaugă eveniment

# actionEditEvent
source: Edit event
ro: Modifică eveniment

# actionDeleteEvent
source: Delete event
ro: Șterge eveniment

# actionChooseClasses
source: Choose classes
ro: Alege materii

# actionAddShortcut
source: Add shortcut
ro: Adaugă scurtătură

# actionDeleteShortcut
source: Delete shortcut
ro: Șterge scurtătură

# actionShowMore
source: Show more
ro: Mai multe

# actionEditGrading
source: Edit grading
ro: Modifică punctaj

# actionContribute
source: Contribute
ro: Contribuie

# actionOpenFilter
source: Open filter
ro: Deschide filtru

# actionRequestPermissions
source: Request permissions
ro: Cere permisiuni

# actionRefresh
source: Refresh
ro: Reîncarcă

# errorSomethingWentWrong
source: Something went wrong.
ro: A apărut o problemă.

# errorPasswordsDiffer
source: The two passwords differ.
ro: Cele două parole diferă.

# errorIncorrectPassword
source: The password you entered is incorrect.
ro: Parola introdusă nu este corectă.

# errorNoPassword
source: You need to provide a password.
ro: Trebuie să introduceți parola.

# errorInvalidEmail
source: You need to provide a valid e-mail address.
ro: Trebuie să introduceți un e-mail valid.

# errorMissingFirstName
source: Please provide your first name(s).
ro: Introduceți prenumele.

# errorMissingLastName
source: Please provide your last name(s).
ro: Introduceți numele de familie.

# errorEmailInUse
source: There is already an account associated with this e-mail address
ro: Există deja un cont asociat acestui e-mail.

# errorEmailNotFound
source: An account associated with that e-mail could not be found. Please sign up instead.
ro: Nu am putut găsi un cont asociat cu adresa de mail. Vă rugăm să vă înregistrați.

# errorAccountDisabled
source: The account has been disabled.
ro: Contul a fost dezactivat.

# errorTooManyRequests
source: There have been too many requests from this device.
ro: Au fost trimise prea multe cereri de pe acest dispozitiv.

# errorCouldNotLaunchURL
source: Could not launch '{url}'.
ro: Nu s-a putut deschide '{url}'.

# errorPermissionDenied
source: You do not have permission to do that.
ro: Nu aveți suficiente permisiuni.

# errorEventTypeCannotBeEmpty
source: Event type cannot be empty.
ro: Tipul de eveniment trebuie precizat.

# errorClassCannotBeEmpty
source: Class cannot be empty.
ro: Materia trebuie precizată.

# errorAnswerCannotBeEmpty
source: Answer cannot be empty.
ro: Răspunsul trebuie precizat.

# errorAnswerIncorrect
source: The answer you entered is incorrect.
ro: Răspunsul introdus nu este corect.

# errorPictureSizeToBig
source: Please select a picture that is less than 5MB.
ro: Selectați o fotografie care are mai puțin de 5MB.

# errorImage
source: The image could not be loaded.
ro: Imaginea nu putut fi încărcată.

# errorInsertGoogleEvents
source: Unable to insert events in Google Calendar.
ro: Evenimentele nu au putut fi inserate în Google Calendar.

# errorLoadRequests
source: Could not load requests
ro: Cererile nu au putut fi încărcate

# errorUnknownUser
source: Unknown User
ro: Utilizator Necunoscut

# warningRequestExists
source: Request already exists
ro: O cerere deja există

# warningInternetConnection
source: Please make sure you have an internet connection.
ro: Asigurați-vă că sunteți conectat la internet.

# warningPasswordLength
source: The password must be 8 characters long or more.
ro: Parola trebuie să aibă cel puțin 8 caractere.

# warningSamePassword
source: The password must be different from the old one.
ro: Parola trebuie sa fie diferită de cea veche.

# warningPasswordUppercase
source: The password must include at least one uppercase letter.
ro: Parola trebuie să conțină cel putin o majusculă.

# warningPasswordLowercase
source: The password must include at least one lowercase letter.
ro: Parola trebuie să conțină cel putin o minusculă.

# warningPasswordSpecialCharacters
source: The password must include at least one special character.
ro: Parola trebuie să conțină cel puțin un simbol.

# warningPasswordNumber
source: The password must include at least one number.
ro: Parola trebuie să conțină cel puțin un număr.

# warningEmailInUse
source: There is already an account associated with {email}.
ro: Există deja un cont asociat cu adresa {email}.

# warningUseProvider
source: Please log in with {provider} to continue.
ro: Folosiți {provider} pentru a vă conecta.

# warningTryAgainLater
source: Please try again later.
ro: Încercați mai târziu.

# warningFilterAlreadyDisabled
source: Already showing all content.
ro: Întreg conținutul este vizibil deja.

# warningFilterAlreadyUnprocessed
source: Already showing unprocessed requests
ro: Deja sunt vizibile doar cererile fără răspuns

# warningFilterAlreadyAll
source: Already showing all requests.
ro: Toate cererile sunt vizibile deja.

# warningFeedbackAlreadySent
source: You have already submitted feedback for this class!
ro: Ați trimis deja feedback pentru această materie!

# warningFilterAlreadyShowingYours
source: Already showing only custom websites.
ro: Deja sunt vizibile doar site-urile personale.

# warningInvalidURL
source: You need to provide a valid URL.
ro: Trebuie să introduceți un URL valid.

# warningWebsiteNameExists
source: A website with the same name already exists.
ro: Există deja un site cu același nume.

# warningNoPrivateWebsite
source: You have not created any private websites yet.
ro: Nu ați creat nici un website privat încă.

# warningNoPermissionToAddPublicWebsite
source: You do not have permission to create a public website.
ro: Nu aveți permisiunea să creați site-uri publice.

# warningAuthenticationNeeded
source: Please authenticate in order to access this feature.
ro: Autentificați-vă pentru a accesa această funcționalitate.

# warningNothingToEdit
source: There is nothing you have permission to edit.
ro: Nu există nimic pentru care să aveți permisiuni de editare.

# warningFieldCannotBeEmpty
source: Field cannot be empty.
ro: Câmpul nu poate fi gol.

# warningFieldCannotBeZero
source: Field cannot be zero.
ro: Câmpul nu poate fi zero.

# warningNoneYet
source: None yet
ro: Nu există încă

# warningRequestEmpty
source: The request must not be empty
ro: Textul cererii nu poate să fie gol.

# warningAgreeTo
source: You need to agree to the
ro: Trebuie să fiți de acord cu

# warningOnlyNOptionsAtATime
source: Only {n} options can be selected at a time.
ro: Doar {n} opțiuni pot fi selectate la un moment dat.

# warningNoEvents
source: No events to show
ro: Nu există evenimente de afișat

# warningYouNeedToSelectAtLeastOne
source: You need to select at least one option.
ro: Trebuie să selectați cel puțin o opțiune.

# warningYouNeedToSelectAssistant
source: You need to select your assistant for this class.
ro: Trebuie să selectați asistentul de la această materie.

# warningFavouriteWebsitesInitializationFailed
source: Could not read favourite websites.
ro: Nu se pot citi date despre site-urile favorite.

# warningUnableToReachNewsFeed
source: Unable to reach the news feed.
ro: Nu am putut încărca fluxul de știri.

# warningNoNews
source: There are no news yet.
ro: Nu au fost postate știri încă.

# warningEventNotEditable
source: This event cannot be edited.
ro: Acest eveniment nu poate fi modificat.

# navigationAskPermissions
source: Ask for permissions
ro: Cere permisiuni

# navigationHome
source: Home
ro: Acasă

# navigationTimetable
source: Timetable
ro: Orar

# navigationMap
source: Map
ro: Hartă

# navigationProfile
source: Profile
ro: Profil

# navigationPeople
source: People
ro: Persoane

# navigationSettings
source: Settings
ro: Setări

# navigationFilter
source: Filter
ro: Filtru

# navigationClasses
source: Classes
ro: Materii

# navigationEventDetails
source: Event details
ro: Detalii eveniment

# navigationNewsFeed
source: News feed
ro: Știri

# navigationClassInfo
source: Class information
ro: Informații materie

# navigationSearch
source: Search
ro: Căutare

# navigationSearchResults
source: Classes found
ro: Materii găsite

# navigationClassesFeedbackChecklist
source: Feedback checklist
ro: Listă feedback

# navigationAdmin
source: Permission requests
ro: Cereri permisiuni

# filterMenuShowAll
source: Show all
ro: Arată tot

# filterMenuShowMine
source: Show only mine
ro: Arată doar pe ale mele

# filterMenuRelevance
source: Filter by relevance
ro: Filtrează după relevanță

# filterMenuShowUnprocessed
source: Show unprocessed
ro: Arată fără răspuns

# filterNodeNameBSc
source: Bachelor's
ro: Licență

# filterNodeNameMSc
source: Master's
ro: Master

# relevanceOnlyMe
source: Only me
ro: Doar eu

# relevanceAnyone
source: Anyone
ro: Oricine

# settingsTitlePersonalization
source: Personalization
ro: Personalizare

# settingsItemDarkMode
source: Dark Mode
ro: Mod Întunecat

# settingsTitleLocalization
source: Localization
ro: Localizare

# settingsTitleDataControl
source: Data control
ro: Control date

# settingsItemEditingPermissions
source: Your editing permissions
ro: Permisiunile tale de editare

# settingsPermissionsNone
source: No special permissions
ro: Fără permisiuni speciale

# settingsPermissionsAdd
source: Permission to add public info
ro: Permisiune pentru adăugare de date publice

# settingsPermissionsEdit
source: Permission to edit public info
ro: Permisiune pentru editare de date publice

# settingsAdminPermissions
source: Admin permissions
ro: Permisiuni de administrator

# settingsPermissionsRequestSent
source: Permissions request already sent
ro: Cerere pentru permisiuni trimisă

# settingsItemLanguage
source: Language
ro: Limbă

# settingsItemLanguageEnglish
source: English
ro: Engleză

# settingsItemLanguageRomanian
source: Romanian
ro: Română

# settingsItemAdmin
source: Admin Panel
ro: Panoul Administratorului

# settingsRelevanceFilter
source: Relevance filter
ro: Filtru de relevanță

# settingsExportToGoogleCalendar
source: Export events to Google Calendar
ro: Exportă evenimentele în Google Calendar

# settingsTitleTimetable
source: Timetable
ro: Orar

# websiteCategoryLearning
source: Learning
ro: Cursuri

# websiteCategoryAdministrative
source: Administrative
ro: Administrativ

# websiteCategoryAssociations
source: Associations
ro: Asociații

# websiteCategoryResources
source: Resources
ro: Resurse

# websiteCategoryOthers
source: Others
ro: Altele

# uniEventTypeLab
source: Lab
ro: Laborator

# uniEventTypeLecture
source: Lecture
ro: Curs

# uniEventTypeSports
source: Sports
ro: Sport

# uniEventTypeExam
source: Exam
ro: Examen

# uniEventTypeHomework
source: Homework
ro: Temă

# uniEventTypeProject
source: Project
ro: Proiect

# uniEventTypePractical
source: Practical
ro: Colocviu

# uniEventTypeResearch
source: Research
ro: Cercetare

# uniEventTypeHoliday
source: Holiday
ro: Vacanță

# uniEventTypeExamSession
source: Exam session
ro: Sesiune de examene

# uniEventTypeSemester
source: Semester
ro: Semestru

# uniEventTypeOther
source: Other
ro: Altul

# messageWelcomeSimple
source: Welcome!
ro: Bine ai venit!

# messageWelcomeName
source: Welcome, {name}!
ro: Bine ai venit, {name}!

# messageNewUser
source: New user?
ro: Utilizator nou?

# messageEmailNotVerified
source: Account is not verified.
ro: Contul nu este verificat.

# messageNotLoggedIn
source: You need to be logged in to perform this action.
ro: Trebuie să fiți autentificat pentru a realiza această acțiune.

# messageEmailNotVerifiedToPerformAction
source: Your account needs to be verified to perform this action.
ro: Contul trebuie să fie verificat pentru a realiza această acțiune.

# messageAccountCreated
source: Account created successfully.
ro: Contul a fost creat cu succes.

# messageAccountDeleted
source: Account deleted successfully.
ro: Contul a fost șters cu succes.

# messageAnnouncedOnMail
source: You will receive a mail confirmation if your request is approved.
ro: Veți primi o confirmare pe mail dacă vi se acceptă cererea.

# messageCheckEmailVerification
source: Please check your email for account verification.
ro: Verificați-vă mail-ul pentru confirmarea contului.

# messageResetPassword
source: Enter your e-mai in order to receive instructions on how to reset your password.
ro: Introduceți mail-ul pentru a primi instrucțiuni de resetare a parolei.

# messageDeleteAccount
source: Are you sure you want to delete your account?
ro: Sunteți sigur că doriți să ștergeți contul?

# messageCannotBeUndone
source: This action cannot be undone.
ro: Această acțiune nu este reversibilă.

# messageChangeEmail
source: Are you sure you want to change the account email to {email}?
ro: Sunteți sigur că doriți să schimbați email-ul cu {email}?

# messageUnderConstruction
source: Under construction
ro: În construcție

# messageWebsitePreview
source: Try tapping/long-pressing/hovering the preview to test the new website.
ro: Încercați să apăsați, să faceți hover sau să țineți apăsat ca să testați noul website.

# messageAddCustomWebsite
source: Try adding a custom website.
ro: Încercați să adăugați un website.

# messageWebsiteAdded
source: Website added successfully.
ro: Website adăugat cu succes.

# messageWebsiteEdited
source: Website modified successfully.
ro: Website modificat cu succes.

# messageDeleteWebsite
source: Are you sure you want to delete this website?
ro: Sunteți sigur că doriți să ștergeți acest website?

# messageWebsiteDeleted
source: Website deleted successfully.
ro: Website-ul a fost șters cu succes.

# messageDeleteEvent
source: Are you sure you want to delete this event?
ro: Sunteți sigur că doriți să ștergeți acest eveniment?

# messageEventDeleted
source: Event deleted successfully.
ro: Eveniment șters cu succes.

# messageEventAdded
source: Event added successfully.
ro: Eveniment adăugat cu succes.

# messageEventEdited
source: Event modified successfully.
ro: Eveniment modificat cu succes.

# messageDeleteShortcut
source: Are you sure you want to delete "{shortcutName}"?
ro: Sunteți sigur că doriți să ștergeți "{shortcutName}"?

# messageThisCouldAffectOtherStudents
source: This could affect other students.
ro: Alți studenți ar putea fi afectați.

# messageShortcutDeleted
source: Shortcut deleted successfully.
ro: Scurtătura a fost ștearsă cu succes.

# messageNoClassesYet
source: You have not added any classes yet.
ro: Nu ați adăugat nici o materie încă.

# messageGetStartedByPressing
source: Get started by pressing the
ro: Începeți prin a apăsa butonul

# messageButtonAbove
source: button above
ro: de mai sus.

# messageAskPermissionToEdit
source: Why do you want edit permissions for {appName}?
ro: De ce dorești să primești permisiuni de editare în {appName}?

# messageRequestHasBeenSent
source: The request has been sent successfully.
ro: Cererea a fost transmisă cu succes

# messageFeedbackHasBeenSent
source: The review has been sent successfully.
ro: Feedback trimis cu succes.

# messageRequestAlreadyExists
source: You have already submitted a request. If you want to add another one, please press 'Send'.
ro: Ați trimis deja o cerere. Daca doriți să adăugați una nouă, vă rugăm sa apasați 'Salvare'.

# messageIAgreeToThe
source: I agree to the
ro: Sunt de acord cu

# messageEditProfileSuccess
source: Profile updated successfully.
ro: Profilul a fost actualizat cu succes.

# messageTapForMoreInfo
source: Tap for more info
ro: Apasă pentru mai multe informații

# messageChangePasswordSuccess
source: Password changed successfully.
ro: Parola a fost schimbată cu succes.

# messageChangeEmailSuccess
source: Email changed successfully
ro: Email-ul a fost schimbat cu succes

# messageAgreePermissions
source: I will only upload information that is correct and accurate, to the best of my knowledge. I understand that submitting erroneous or offensive information on purpose will lead to my editing permissions being permanently revoked.
ro: Voi încărca doar informații corecte si precise. Înțeleg că încărcarea informațiilor eronate sau ofensatoare în mod intenționat va conduce la blocarea permisiunilor mele permanent.

# messageAgreeFeedbackPolicy
source: I understand this survey is extremely important for the continuous development of the educational process and I will only provide valuable and constructive feedback for this class.
ro: Înțeleg că acest sondaj este extrem de important pentru dezvoltarea continuă a procesului educațional și voi oferi doar feedback valoros și constructiv pentru această materie.

# messageYouCanContribute
source: You can contribute to the app data, but you first need to request permissions.
ro: Poți contribui la datele din aplicație, dar trebuie mai întâi să ceri permisiuni.

# messageThereAreNoEventsForSelected
source: There are no events for the selected
ro: Nu există evenimente pentru selecția de

# messagePictureUpdatedSuccess
source: Profile picture updated successfully.
ro: Poza a fost actualizată cu succes.

# messageFeedbackLeft
source: You need to complete {number} more feedback forms!
ro: Trebuie să completezi încă {number} formulare de feedback!

# messageAlreadySeeingCurrentWeek
source: You're already seeing the current week!
ro: Ești deja la săptămâna curentă!

# messageAnotherQuestion
source: Do you have another question?
ro: Ai altă întrebare?

# messageTalkToChatbot
source: Talk to Polly!
ro: Vorbește cu Polly!

# infoRelevance
source: Try to choose the most restrictive category.
ro: Încercați să selectați cea mai restrictivă categorie.

# infoSelect
source: Select the
ro: Selectați

# infoYouNeedToSelect
source: You first need to select the
ro: Trebuie întâi să selectați

# infoClasses
source: classes you are interested in
ro: materiile care vă interesează

# infoMakeSureGroupIsSelected
source: Make sure your group/subgroup is selected in the
ro: Asigurați-vă că aveți grupa/semigrupa selectată în

# infoRelevanceNothingSelected
source: If this is relevant for everyone, don't select anything .
ro: Nu selectați nimic dacă este relevant pentru toată lumea.

# infoRelevanceExample
source: For instance, if something is only relevant for "314CB" and "315CB", don't just set "CB".
ro: De exemplu, dacă ceva este relevant doar pentru "314CB" și "315CB", nu setați direct "CB".

# infoPassword
source: It must contain lower and uppercase letters, one number and one special character, and have a minimum length of 8.
ro: Aceasta trebuie să conțină majuscule, minuscule și cel puțin un număr sau un simbol, având minimum 8 caractere.

# infoAppIsOpenSource
source: {appName} is open source.
ro: {appName} este open source.

# infoEmail
source: This is the same username you use to log in to {forum}.
ro: Acesta este același username pe care îl folosești să te loghezi pe {forum}.

# infoLoading
source: Loading...
ro: Se încarcă...

# infoReadThePolicy
source: Read the {appName} policy
ro: Citește politica {appName}

# infoExportToGoogleCalendar
source: Export filtered events from Timetable
ro: Exportă evenimentele filtrate din Orar

# infoFormAnonymous
source: This form is anonymous.
ro: Acest formular este anonim.

# infoAdmin
source: Handle permission requests
ro: Trateaza cererile de permisiuni

# infoAccepted
source: Accepted
ro: Acceptat
