Repository: student-hub/acs-upb-mobile
Catalog: lib/l10n/intl_*.arb
Languages: ro

# infoDenied
source: Denied
ro: Refuzat

# stringAnonymous
source: Anonymous
ro: Anonim

# stringAnd
source: and
ro: și

# stringAt
source: at
ro: la

# fileAcsBanner
source: assets/images/acs_banner_en.png
ro: assets/images/acs_banner_ro.png
